# Pandas - Intro

* PanDaS: Panel Data Sets
* Biblioteca de Python para trabajar con datos: analizar, limpiar, explorar y manipular los datos
* Sirve para manipular tablas de datos (DataFrame)
* Permite analizar grandes datos y sacar conclusiones basadas en teorías estadísticas:
  * ¿Existe una correlación entre dos o más variables/columnas?
  * ¿Cual es el valor medio, máximo, mínimo?
  * Etc.
* Limpiar datos: eliminar casos/filas irrelevantes o que contienen valores incorrectos (valores vacíos o nulos)

## Instalación

pip install pandas

## Ejemplo

In [2]:
import pandas as pd  # gralmente. se importa con el alias pd

In [3]:
datos = {
  'cars': ["BMW", "Volvo", "Ford"],
  'passings': [3, 7, 2]
}

In [4]:
df = pd.DataFrame(datos)
df

    cars  passings
0    BMW         3
1  Volvo         7
2   Ford         2

In [5]:
fbk = ['Facebook', 2449, True, 2006]
twt = ['Twitter', 339, False, 2006]
igm = ['Instagram', 1000, True, 2010]
ytb = ['YouTube', 2000, False, 2005]
lkn = ['LinkedIn', 663, False, 2003]
wsp = ['WhastsApp', 1600, True, 2009]

rrss = [fbk, twt, igm, ytb, lkn, wsp]

df = pd.DataFrame(rrss, columns=['Nombre', 'Cantidad', 'es_FBK', 'Año'])
df

      Nombre  Cantidad  es_FBK   Año
0   Facebook      2449    True  2006
1    Twitter       339   False  2006
2  Instagram      1000    True  2010
3    YouTube      2000   False  2005
4   LinkedIn       663   False  2003
5  WhastsApp      1600    True  2009

In [30]:
# crear dataframe vacio
df = pd.DataFrame(columns=['Nombre', 'Edad'])
df

Empty DataFrame
Columns: [Nombre, Edad]
Index: []

In [31]:
df.loc[0]  = {'Nombre': 'Pablo', 'Edad': 38}
df

  Nombre  Edad
0  Pablo    38